EMPLOYMENT_TYPE = (
        ('PO', 'Полная'),
        ('CH', 'Частичная'),
        ('PR', 'Проектная'),
        ('ST', 'Стажировка'),
        ('VO', 'Волонтерство'),
    )

SCHEDULE_WORK = (
        ('P', 'Полный день'),
        ('S', 'Сменный график'),
        ('G', 'Гибкий график'),
        ('U', 'Удаленная работа'),
        ('W', 'Вахтовый метод'),
    )

RELOCATION = (
        ('VZ', 'Возможен'),
        ('NV', 'Невозможен'),
        ('GL', 'Желателен'),
        ('NG', 'Нежелателен'),
    )

GENDER = (
        ('M', 'Мужской'),
        ('W', 'Женский'),
    )

MARITAL_STATUS = (
        ('N', 'Холост(Не замужем)'),
        ('Y', 'Женат(Замужем)'),
    )

EDUCATION = (
        ('SN', 'Среднее неполное'),
        ('SR', 'Среднее'),
        ('SP', 'Среднее профессиональное'),
        ('VN', 'Высшее неполное'),
        ('VS', 'Высшее'),
    )